/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[任一日期]@";
"%@ %[Today]@" = "%1$@ %2$[今天]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[從昨天起]@";
"%@ %[This week]@" = "%1$@ %2$[本週]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[在過去 2 週]@";
"%@ %[This month]@" = "%1$@ %2$[本月]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[在過去 2 個月]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[所有]@";
"%@ %[Yes]@" = "%1$@ %2$[是]@";
"%@ %[No]@" = "%1$@ %2$[否]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[包含]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[開頭為]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[結尾為]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[是]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[正好是]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[早於]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[晚於]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[大於]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[小於]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[在過去]@ %3$@ %4$[天]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[在過去]@ %3$@ %4$[週]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[在過去]@ %3$@ %4$[個月]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[在過去]@ %3$@ %4$[年]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[色彩空間]@ %2$[所有色彩空間]@";
"%[Color Space]@ %[RGB]@" = "%1$[色彩空間]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[色彩空間]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[色彩空間]@ %2$[灰階]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[內容]@ 包含 %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[持續時間]@ %2$[大於]@ %3$@ %4$[分鐘]@ %5$@ %6$[秒]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[持續時間]@ %2$[小於]@ %3$@ %4$[分鐘]@ %5$@ %6$[秒]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[關鍵字]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[關鍵字]@ 包含 %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[種類]@ 是 %2$[所有]@";
"%[Kind]@ is %[Images]@" = "%1$[種類]@ 是 %2$[影像]@";
"%[Kind]@ is %[Text]@" = "%1$[種類]@ 是 %2$[文字]@";
"%[Kind]@ is %[PDF]@" = "%1$[種類]@ 是 %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[種類]@ 是 %2$[影片]@";
"%[Kind]@ is %[Music]@" = "%1$[種類]@ 是 %2$[音樂]@";
"%[Kind]@ is %[Documents]@" = "%1$[種類]@ 是 %2$[文件]@";
"%[Kind]@ is %[Presentations]@" = "%1$[種類]@ 是 %2$[簡報]@";
"%[Kind]@ is %[Folders]@" = "%1$[種類]@ 是 %2$[檔案夾]@";
"%[Kind]@ is %[Applications]@" = "%1$[種類]@ 是 %2$[應用程式]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[種類]@ 是 %2$[其他⋯]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[標籤]@ 是 %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[上次開啟日期]@ %2$[任一日期]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[上次修改日期]@ %2$[任一日期]@";
"%[Created]@ %[Any Date]@" = "%1$[製作日期]@ %2$[任一日期]@";
"%[Last Opened]@ %[Today]@" = "%1$[上次開啟日期]@ %2$[今天]@";
"%[Last Modified]@ %[Today]@" = "%1$[上次修改日期]@ %2$[今天]@";
"%[Created]@ %[Today]@" = "%1$[製作日期]@ %2$[今天]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[上次開啟日期]@ %2$[從昨天起]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[上次修改日期]@ %2$[從昨天起]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[製作日期]@ %2$[從昨天起]@";
"%[Last Opened]@ %[This week]@" = "%1$[上次開啟日期]@ %2$[本週]@";
"%[Last Modified]@ %[This week]@" = "%1$[上次修改日期]@ %2$[本週]@";
"%[Created]@ %[This week]@" = "%1$[製作日期]@ %2$[本週]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[上次開啟日期]@ %2$[在過去 2 週]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[上次修改日期]@ %2$[在過去 2 週]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[製作日期]@ %2$[在過去 2 週]@";
"%[Last Opened]@ %[This month]@" = "%1$[上次開啟日期]@ %2$[本月]@";
"%[Last Modified]@ %[This month]@" = "%1$[上次修改日期]@ %2$[本月]@";
"%[Created]@ %[This month]@" = "%1$[製作日期]@ %2$[本月]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[上次開啟日期]@ %2$[在過去 2 個月]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[上次修改日期]@ %2$[在過去 2 個月]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[製作日期]@ %2$[在過去 2 個月]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[上次開啟日期]@ %2$[正好是]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[上次修改日期]@ %2$[正好是]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[製作日期]@ %2$[正好是]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[上次開啟日期]@ %2$[早於]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[上次修改日期]@ %2$[早於]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[製作日期]@ %2$[早於]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[上次開啟日期]@ %2$[晚於]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[上次修改日期]@ %2$[晚於]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[製作日期]@ %2$[晚於]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[上次開啟日期]@ %2$[在過去]@ %3$@ %4$[天]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[上次修改日期]@ %2$[在過去]@ %3$@ %4$[天]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[製作日期]@ %2$[在過去]@ %3$@ %4$[天]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[上次開啟日期]@ %2$[在過去]@ %3$@ %4$[週]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[上次修改日期]@ %2$[在過去]@ %3$@ %4$[週]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[製作日期]@ %2$[在過去]@ %3$@ %4$[週]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[上次開啟日期]@ %2$[在過去]@ %3$@ %4$[個月]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[上次修改日期]@ %2$[在過去]@ %3$@ %4$[個月]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[製作日期]@ %2$[在過去]@ %3$@ %4$[個月]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[上次開啟日期]@ %2$[在過去]@ %3$@ %4$[年]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[上次修改日期]@ %2$[在過去]@ %3$@ %4$[年]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[製作日期]@ %2$[在過去]@ %3$@ %4$[年]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[音樂類型]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[擴展名]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[名稱]@ %2$[包含]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[名稱]@ %2$[開頭為]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[名稱]@ %2$[結尾為]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[名稱]@ %2$[是]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[方向]@ %2$[所有方向]@";
"%[Orientation]@ %[Landscape]@" = "%1$[方向]@ %2$[橫式]@";
"%[Orientation]@ %[Portrait]@" = "%1$[方向]@ %2$[直式]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[其他⋯]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Raw 查詢]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[搜尋]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[大小]@ %2$[大於]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[大小]@ %2$[小於]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[大小]@ %2$[大於]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[大小]@ %2$[小於]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[大小]@ %2$[大於]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[大小]@ %2$[小於]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[可見性]@ %2$[可見或不可見]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[可見性]@ %2$[可見項目]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[可見性]@ %2$[不可見項目]@";

